app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "articles" SET "status" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["status", "private"], ["updated_at", "2021-11-05 15:08:09.869473"], ["id", 13]]